using System.Windows;
using System.Windows.Controls;


namespace Lab2_3
{
    /// <summary>
    /// Логика взаимодействия для MainWindow.xaml
    /// </summary>
    public partial class MainWindow : Window
    {
        public MainWindow()
        {
            InitializeComponent();
            ListOfPlanets.Items.Add("Меркурий");
            ListOfPlanets.Items.Add("Венера");
            ListOfPlanets.Items.Add("Земля");
            ListOfPlanets.Items.Add("Марс");
            ListOfPlanets.Items.Add("Юпитер");
            ListOfPlanets.Items.Add("Сатурн");
            ListOfPlanets.Items.Add("Уран");
            ListOfPlanets.Items.Add("Нептун");
        }
        private void ListOfPlanets_SelectionChanged(object sender, SelectionChangedEventArgs e)
        {
            var planet = ListOfPlanets.SelectedIndex;
            if (planet == 0)
                Description.Text = "Мерку́рий — ближайшая к Солнцу планета Солнечной системы, наименьшая из планет земной группы. Названа в честь древнеримского бога торговли — быстрого Меркурия, поскольку она движется по небу быстрее других планет. Её период обращения вокруг Солнца составляет всего 87,97 земных суток — самый короткий среди всех планет Солнечной системы.";
            if (planet == 1)
                Description.Text = "Вене́ра — вторая по удалённости от Солнца планета Солнечной системы, наряду с Меркурием, Землёй и Марсом принадлежащая к семейству планет земной группы. Названа в честь древнеримской богини любви Венеры. По ряду характеристик — например, по массе и размерам — Венера считается «сестрой» Земли. Венерианский год составляет 224,7 земных суток.";
            if (planet == 2)
                Description.Text = "Земля́ — третья по удалённости от Солнца планета Солнечной системы. Самая плотная, пятая по диаметру и массе среди всех планет и крупнейшая среди планет земной группы, в которую входят также Меркурий, Венера и Марс. Единственное известное человеку в настоящее время тело Солнечной системы в частности и Вселенной вообще, населённое живыми организмами.";
            if (planet == 3)
                Description.Text = "Марс — четвёртая по удалённости от Солнца и седьмая по размерам планета Солнечной системы; масса планеты составляет 10,7 % массы Земли. Названа в честь Марса — древнеримского бога войны, соответствующего древнегреческому Аресу. Иногда Марс называют «красной планетой» из-за красноватого оттенка поверхности, придаваемого ей минералом маггемитом — γ-оксидом железа(III).";
            if (planet == 4)
                Description.Text = "Юпи́тер — крупнейшая планета Солнечной системы, пятая по удалённости от Солнца. Наряду с Сатурном, Ураном и Нептуном, Юпитер классифицируется как газовый гигант. Планета была известна людям с глубокой древности, что нашло своё отражение в мифологии и религиозных верованиях различных культур: месопотамской, вавилонской, греческой и других.Современное название Юпитера происходит от имени древнеримского верховного бога - громовержца.";
            if (planet == 5)
                Description.Text = "Сату́рн — шестая планета от Солнца и вторая по размерам планета в Солнечной системе после Юпитера. Сатурн, а также Юпитер, Уран и Нептун, классифицируются как планеты-гиганты. Сатурн назван в честь римского бога земледелия. Символ Сатурна — серп.";
            if (planet == 6)
                Description.Text = "Ура́н — планета Солнечной системы, седьмая по удалённости от Солнца, третья по диаметру и четвёртая по массе. Была открыта в 1781 году английским астрономом Уильямом Гершелем и названа в честь греческого бога неба Урана.";
            if (planet == 7)
                Description.Text = "Непту́н — восьмая и самая дальняя от Солнца и Земли планета Солнечной системы. Его масса больше чем у Земли в 17,2 раза и является третьей среди планет Солнечной системы, а по экваториальному диаметру Нептун занимает четвёртое место, превосходя Землю в 3,9 раза. Планета названа в честь римского бога морей.";
        }
    }
}

      
